polished the README file and added thw Gif of the demo
